Repository: markbattistella/ZodiacKit
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, ru, uk, zh_hans

source: Could not construct a date for the given day (%1$lld) and month (%2$lld) using a leap year.
de: Konnte kein Datum für den angegebenen Tag (%1$lld) und Monat (%2$lld) mit einem Schaltjahr erstellen.
es: No se pudo construir una fecha para el día (%1$lld) y el mes (%2$lld) usando un año bisiesto.
fr: Impossible de construire une date pour le jour (%1$lld) et le mois (%2$lld) en utilisant une année bissextile.
it: Impossibile creare una data per il giorno (%1$lld) e il mese (%2$lld) utilizzando un anno bisestile.
ja: うるう年を使用して日 (%1$lld) と月 (%2$lld) の日付を作成できませんでした。
ko: 윤년을 사용하여 날짜(%1$lld)와 월(%2$lld)에 대한 날짜를 생성할 수 없습니다.
pt_br: Não foi possível construir uma data para o dia (%1$lld) e o mês (%2$lld) usando um ano bissexto.
ru: Не удалось создать дату для дня (%1$lld) и месяца (%2$lld), используя високосный год.
uk: Не вдалося створити дату для дня (%1$lld) і місяця (%2$lld) із використанням високосного року.
zh_hans: 无法使用闰年来构建给定日期 (%1$lld) 和月份 (%2$lld) 的日期。

source: Duplicate zodiac signs found: %@. Each sign should only appear once.
de: Doppelte Sternzeichen gefunden: %@. Jedes Zeichen darf nur einmal erscheinen.
es: Se encontraron signos del zodíaco duplicados: %@. Cada signo debe aparecer solo una vez.
fr: Signes du zodiaque en double trouvés : %@. Chaque signe ne doit apparaître qu’une seule fois.
it: Trovati segni zodiacali duplicati: %@. Ogni segno deve apparire solo una volta.
ja: 重複した星座が見つかりました: %@。各星座は一度だけ表示される必要があります。
ko: 중복된 별자리가 발견되었습니다: %@. 각 별자리는 한 번만 나타나야 합니다.
pt_br: Foram encontrados signos do zodíaco duplicados: %@. Cada signo deve aparecer apenas uma vez.
ru: Найдены дублирующиеся знаки зодиака: %@. Каждый знак должен появляться только один раз.
uk: Знайдено дублікати знаків зодіаку: %@. Кожен знак повинен з’являтися лише один раз.
zh_hans: 发现重复的星座：%@。每个星座只能出现一次。

source: Invalid date components were found in %@.
de: Ungültige Datumskomponenten wurden in %@ gefunden.
es: Se encontraron componentes de fecha no válidos en %@.
fr: Des composants de date non valides ont été trouvés dans %@.
it: Sono stati trovati componenti di data non validi in %@.
ja: %@ に無効な日付コンポーネントが見つかりました。
ko: %@에서 잘못된 날짜 구성 요소가 발견되었습니다.
pt_br: Foram encontrados componentes de data inválidos em %@.
ru: В %@ найдены недопустимые компоненты даты.
uk: У %@ знайдено недійсні компоненти дати.
zh_hans: 在 %@ 中发现无效的日期组件。

source: Missing zodiac definitions for: %@. All expected signs must be present.
de: Fehlende Sternzeichendefinitionen für: %@. Alle erwarteten Zeichen müssen vorhanden sein.
es: Faltan definiciones del zodíaco para: %@. Todos los signos esperados deben estar presentes.
fr: Définitions du zodiaque manquantes pour : %@. Tous les signes attendus doivent être présents.
it: Definizioni zodiacali mancanti per: %@. Tutti i segni previsti devono essere presenti.
ja: 次の星座の定義が欠落しています: %@。すべての星座が存在する必要があります。
ko: %@에 대한 별자리 정의가 누락되었습니다. 모든 예상된 별자리가 포함되어야 합니다.
pt_br: Definições de signos do zodíaco ausentes para: %@. Todos os signos esperados devem estar presentes.
ru: Отсутствуют определения знаков зодиака для: %@. Все ожидаемые знаки должны быть указаны.
uk: Відсутні визначення знаків зодіаку для: %@. Усі очікувані знаки мають бути присутні.
zh_hans: 缺少以下星座定义：%@。必须包含所有预期的星座。

source: Multiple zodiac signs overlap on the same day(s): %@. Each day should be uniquely assigned.
de: Mehrere Sternzeichen überlappen an den gleichen Tagen: %@. Jeder Tag sollte eindeutig zugewiesen sein.
es: Múltiples signos del zodíaco se superponen en los mismos días: %@. Cada día debe asignarse de forma única.
fr: Plusieurs signes du zodiaque se chevauchent aux mêmes jours : %@. Chaque jour doit être attribué de façon unique.
it: Più segni zodiacali si sovrappongono negli stessi giorni: %@. Ogni giorno deve essere assegnato in modo univoco.
ja: 同じ日に複数の星座が重複しています: %@。各日は一意に割り当てられる必要があります。
ko: 여러 별자리가 같은 날짜에 중복되어 있습니다: %@. 각 날짜는 고유하게 할당되어야 합니다.
pt_br: Vários signos do zodíaco se sobrepõem nos mesmos dias: %@. Cada dia deve ser atribuído exclusivamente.
ru: Некоторые знаки зодиака пересекаются в одни и те же дни: %@. Каждый день должен быть назначен однозначно.
uk: Декілька знаків зодіаку перекриваються в одні й ті ж дні: %@. Кожен день має бути призначений унікально.
zh_hans: 多个星座在同一天重叠：%@。每一天必须唯一分配。

# No zodiac sign was found for day number %lld.
source: No zodiac sign was found for day number %1$lld.
de: Kein Sternzeichen wurde für die Tagesnummer %1$lld gefunden.
es: No se encontró ningún signo del zodíaco para el número de día %1$lld.
fr: Aucun signe du zodiaque n’a été trouvé pour le numéro de jour %1$lld.
it: Nessun segno zodiacale è stato trovato per il numero di giorno %1$lld.
ja: 日数 %1$lld に対して星座が見つかりませんでした。
ko: 일 번호 %1$lld에 해당하는 별자리를 찾을 수 없습니다.
pt_br: Nenhum signo do zodíaco foi encontrado para o número do dia %1$lld.
ru: Не найден знак зодиака для номера дня %1$lld.
uk: Не знайдено знак зодіаку для номера дня %1$lld.
zh_hans: 未找到日期编号为 %1$lld 的星座。

source: Some days are not covered by any zodiac sign: %@.
de: Einige Tage sind keinem Sternzeichen zugeordnet: %@.
es: Algunos días no están cubiertos por ningún signo del zodíaco: %@.
fr: Certains jours ne sont couverts par aucun signe du zodiaque : %@.
it: Alcuni giorni non sono ricompresi in alcun segno zodiacale: %@.
ja: いくつかの日がどの星座にも含まれていません：%@。
ko: 일부 날짜는 어떤 별자리에 할당되어 있지 않습니다: %@.
pt_br: Alguns dias não são cobertos por nenhum signo do zodíaco: %@.
ru: Некоторые дни не покрыты ни одним знаком зодиака: %@.
uk: Деякі дні не охоплені жодним знаком зодіаку: %@.
zh_hans: 某些日期未被任何星座涵盖：%@。

source: The zodiac data is invalid or corrupted.
de: Die Sternzeichendaten sind ungültig oder beschädigt.
es: Los datos del zodíaco son inválidos o están corruptos.
fr: Les données du zodiaque sont invalides ou corrompues.
it: I dati dello zodiaco sono non validi o danneggiati.
ja: 星座データが無効または破損しています。
ko: 별자리 데이터가 유효하지 않거나 손상되었습니다.
pt_br: Os dados do zodíaco são inválidos ou corrompidos.
ru: Данные зодиака недействительны или повреждены.
uk: Дані зодіаку недійсні або пошкоджені.
zh_hans: 星座数据无效或已损坏。

source: Unable to determine the day of the year for the adjusted date: %@.
de: Kann den Tag des Jahres für das angepasste Datum nicht bestimmen: %@.
es: No se puede determinar el día del año para la fecha ajustada: %@.
fr: Impossible de déterminer le jour de l’année pour la date ajustée : %@.
it: Impossibile determinare il giorno dell’anno per la data modificata: %@.
ja: 調整された日付 %@ の年内通算日を決定できません。
ko: 조정된 날짜 %@에 대해 연중 일을 결정할 수 없습니다.
pt_br: Não foi possível determinar o dia do ano para a data ajustada: %@.
ru: Не удалось определить день года для скорректированной даты: %@.
uk: Не вдалося визначити номер дня у році для скоригованої дати: %@.
zh_hans: 无法确定调整日期 %@ 的年度第几天。

source: Zodiac date ranges are not continuous. Every day of the year must be covered without gaps.
de: Die Sternzeichenzeiträume sind nicht durchgängig. Jeder Tag des Jahres muss ohne Lücken abgedeckt sein.
es: Los rangos de fechas del zodíaco no son continuos. Cada día del año debe estar cubierto sin huecos.
fr: Les plages de dates du zodiaque ne sont pas continues. Chaque jour de l’année doit être couvert sans interruption.
it: Gli intervalli di date zodiacali non sono continui. Ogni giorno dell’anno deve essere coperto senza lacune.
ja: 星座の日付範囲が連続していません。年のすべての日が隙間なくカバーされる必要があります。
ko: 별자리 날짜 범위가 연속적이지 않습니다. 연중 모든 날이 격차 없이 포함되어야 합니다.
pt_br: Os intervalos de datas do zodíaco não são contínuos. Cada dia do ano deve estar coberto sem lacunas.
ru: Диапазоны дат зодиака не непрерывны. Каждый день года должен быть покрыт без разрывов.
uk: Інтервали дат зодіаку не є безперервними. Кожен день року має бути охоплений без пропусків.
zh_hans: 星座日期范围不连续。每年的每一天都必须被覆盖且不能有空隙。
